main.floors.MT1=
{
    "floorId": "MT1",
    "title": "魔塔 第01层",
    "name": "第 1 层",
    "width": 13,
    "height": 13,
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,  0,201,202,201,  0,  0,  0,  0,  0,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  0,  1],
    [  1, 31,  0,  0, 81,  0,  1, 27, 21,  0,  1,  0,  1],
    [  1,  0,209,  0,  1,  0,  1, 28, 31,  0,  1,  0,  1],
    [  1,  1, 81,  1,  1,  0,  1,  1,  1, 81,  1,  0,  1],
    [  1, 21,  0,  0,  1,  0, 81,205,217,205,  1,  0,  1],
    [  1,  0,210,  0,  1,  0,  1,  1,  1,  1,  1,  0,  1],
    [  1,  1, 81,  1,  1,  0,  0,  0,  0,  0,  0,  0,  1],
    [  1,  0,  0,  0,  1,  1, 81,  1,  1,  1, 81,  1,  1],
    [  1, 31,  0, 21,  1, 21,  0,127,  1,  0,205,  0,  1],
    [  1, 31, 46, 21,  1,  0,  0,  0,  1,201, 32,201,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "section1.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "item:I333",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "flag:fly",
            "value": "false"
        },
        {
            "type": "tip",
            "text": "游戏已重启"
        },
        {
            "type": "function",
            "function": "function(){\nif (core.isReplaying()) return;\nif (typeof core.domStyle.isVertical === 'undefined') {\n\tcore.domStyle.isVertical = (main.dom.body.clientHeight > main.dom.body.clientWidth);\n}\nif (core.domStyle.isVertical)\n\tcore.strokeRect('outerUI', 346, 538, 32, 32, '#FF0000', 2);\nelse\n\tcore.strokeRect('outerUI', 593, 318, 32, 32, '#FF0000', 2);\n}"
        },
        {
            "type": "choices",
            "text": "\t[作者,king]开启flash特性？选择启用则游戏将允许：对话穿墙、圣水复活、偷雪花，详情见“游戏帮助”（右下角红框）",
            "choices": [
                {
                    "text": "开启（特性版）",
                    "action": [
                        {
                            "type": "setValue",
                            "name": "flag:开启特性",
                            "value": "1"
                        }
                    ]
                },
                {
                    "text": "不开启（纯净版）",
                    "action": [
                        {
                            "type": "setValue",
                            "name": "flag:开启特性",
                            "value": "0"
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    5,
                                    5
                                ],
                                [
                                    6,
                                    5
                                ],
                                [
                                    7,
                                    5
                                ],
                                [
                                    6,
                                    6
                                ]
                            ],
                            "floorId": "MT35",
                            "remove": true
                        }
                    ]
                }
            ]
        },
        {
            "type": "choices",
            "text": "\t[作者,king]开启疯狂加血？（在这个模式下，您的生命仍然要超过怪物伤害才能战斗，但实际战斗中，您将不会受到伤害，而是会回复等量的生命。）",
            "choices": [
                {
                    "text": "开启",
                    "action": [
                        {
                            "type": "setValue",
                            "name": "flag:addhp",
                            "value": "1"
                        }
                    ]
                },
                {
                    "text": "不开启",
                    "action": [
                        {
                            "type": "setValue",
                            "name": "flag:addhp",
                            "value": "0"
                        }
                    ]
                }
            ]
        },
        "\t[作者,king]现在会在开局额外赠送一个削弱版的楼传，它只能在目的地与当前所在地联通时才可以传送。\n本塔还额外增加了一些便利设置，如果您不需要它们，希望体验原汁原味的flash版魔塔，可以在游戏帮助中选择“关闭额外功能”。",
        {
            "type": "setValue",
            "name": "flag:额外功能开关",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "flag:显示详细信息",
            "value": "true"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,10": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "choices",
                    "text": "\t[作者,king]来看看我干了什么吧！自动操作已实装，可以在游戏帮助中打开",
                    "choices": [
                        {
                            "text": "V1.0.0",
                            "action": [
                                "\t[作者,king]2层还原两个无法破震的墙，小偷位置微调\n2层右下小偷变为flash版效果，即对话后直接打开35墙壁\n2层老人有选择“我太需要了”“下次再说”，但是后一个选项无用，暂不还原",
                                "\t[作者,king]3层魔王位置有空气墙，还原\n3层事件会判定是否攻防为100，若为100再将攻防血变为400/10/10，意义不明，暂不还原",
                                "\t[作者,king]4层法师位置调整",
                                "\t[作者,king]10层骷髅队长周围有一圈空气墙，还原\n10层直接进入骷髅队长上方会直接游戏卡死，不予还原，改为空气墙\n10层走到(6,1)时会立即触发骷髅队长战败剧情，还原\n10层部分骷髅为贴图，还原\n10层触发战败剧情后，即使红门存在也不再生效，这里选择直接移除\n10层骷髅队长不防炸，还原\n10层可以杀死骷髅队长后，再次触发机关事件复活骷髅队长，还原\n10层小偷会直接瞬移到楼梯，鉴定为bug，不予还原",
                                "\t[作者,king]12层右上角墙换为不可破震的暗墙",
                                "\t[作者,king]14层左上角墙换为不可破震的暗墙",
                                "\t[作者,king]15层大章鱼有一圈空气墙，但是最上面一格没有，还原\n小偷墙换为不可破震的暗墙",
                                "\t[作者,king]16层圣水墙换为不可破震的暗墙",
                                "\t[作者,king]16层圣水墙换为不可破震的暗墙",
                                "\t[作者,king]20层只有一个蝙蝠是真的，其它全是贴图，左上蝙蝠不可进入，还原\n吸血鬼不防炸，还原\n还原了吸血鬼的合成动画",
                                "\t[作者,king]24层进入点在(6,2)而不是(6,1)，还原\n24层(6,1)存在空气墙，还原",
                                "\t[作者,king]26层公主上面有个不可破震的暗墙，还原",
                                "\t[作者,king]29层小偷墙换为不可破震的暗墙",
                                "\t[作者,king]32层存在两个空气墙，还原",
                                "\t[作者,king]32层存在两个空气墙，还原\n32层被骑士队长击败时，若可以破防对方则可以喝圣水存活",
                                "\t[作者,king]33层骑士剑机关按flash版本还原",
                                "\t[作者,king]34层改为自动事件，较为方便",
                                "\t[作者,king]35层按flash版本还原",
                                "\t[作者,king]38层骑士盾机关按flash版本还原",
                                "\t[作者,king]39层改为自动事件，较为方便",
                                "\t[作者,king]40层按flash版重置，当然，对应位置上无怪物时不需要等待",
                                "\t[作者,king]41层暗墙条件改为：击败左侧红巫师，必须从左往右触发，访问过42层（究竟谁想的如此烦人的条件？）",
                                "\t[作者,king]42层骑士队长改为左侧空地触发，直接接触无效",
                                "\t[作者,king]43层改为打开黄门后，走进黄门格触发机关",
                                "\t[作者,king]49层后flash版本不能存档，拒绝还原",
                                "\t[作者,king]49层改为flash版本，击败魔王后打开下面两个机关门\n49层有5格空气墙，还原\n49层左上墙不可破震，还原",
                                "\t[作者,king]现在可以先上50层再用下楼器来封印魔王了，原有魔王已弃用",
                                "\t[作者,king]替换了游戏手册、地震卷、向上/下传送、镐、炸弹的图像，似乎更好看了？",
                                "\t[作者,king]将一些怪物（如史莱姆）跟道具的名称修改为flash版本",
                                "\t[作者,king]战斗还原为与怪物重合后才战斗",
                                "\t[作者,king]开局的神圣盾变为有效的神圣盾，且阻击怪只会伤害变0，仍然会正常后退",
                                "\t[作者,king]瞬移可以进入事件格，选择还原（但是有一部分不确定是空气墙还是事件格？）",
                                "\t[作者,king]手册改为一防减伤",
                                "\t[作者,king]还原了对话穿墙与32喝圣水复活",
                                "\t[作者,king]门按flash方式重新手绘，全部门素材都是手绘的！",
                                "\t[作者,king]对话穿墙可以穿过无法战胜的怪物与墙，钥匙不足时的门"
                            ]
                        },
                        {
                            "text": "V1.1.0",
                            "action": [
                                "\t[作者,king]初步进行了状态栏的高清化\n加入了魔法伤害的动画，之前版本忘记将夹击改成被神圣盾免疫了，已修改"
                            ]
                        },
                        {
                            "text": "V1.2.0",
                            "action": [
                                "\t[作者,king]修复了damage画布的缩放问题\n将炸弹逻辑改为原版，可以杀死500血以下目标\n将空气墙还原为flash版本，无法对称飞通过的空气墙直接用可见墙绘制\n0层宝石血瓶效果改为0\n道具提示还原，\n将废案高级石头人跟勇士加入游戏，但是不知道对应图标，这里直接使用勇士跟铁怪图标"
                            ]
                        },
                        {
                            "text": "V1.2.1",
                            "action": [
                                "\t[作者,king]尝试修复高清问题，用了一个很邪的邪门办法\n用了一个很邪的邪门办法隐藏了不可对称飞的空气墙\n调整了公主对话，1层下楼点、34层下楼点"
                            ]
                        },
                        {
                            "text": "V1.2.2",
                            "action": [
                                "\t[作者,king]将快捷商店换为读取自动存档\n修复了录像中存档\n现在怪物手册可以在浏览地图时与录像回放中使用\n缩略图改为高清"
                            ]
                        },
                        {
                            "text": "V1.2.3",
                            "action": [
                                "\t[作者,king]将npc对话完全还原为flash版\n修改了一些注册名等，修复了样板的一些错误"
                            ]
                        },
                        {
                            "text": "V1.2.x",
                            "action": [
                                "\t[作者,king]修bug\n将楼传逻辑改为原版，即访问高楼层后，低楼层可以任意传送\n实装自动操作\n"
                            ]
                        },
                        {
                            "text": "V1.3.x",
                            "action": [
                                "\t[作者,king]将更多系统还原为原版风格"
                            ]
                        },
                        {
                            "text": "V1.4.x",
                            "action": [
                                "\t[作者,king]修改了ui"
                            ]
                        },
                        {
                            "text": "V1.5.x",
                            "action": [
                                "\t[作者,king]添加快照存档系统，但是看起来比较屎山，但是至少对需要移动的方案有较好的存档方法了？"
                            ]
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "2,11": [
            {
                "type": "setValue",
                "name": "flag:fly",
                "value": "true"
            }
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "fgmap": [

],
    "upFloor": [
        2,
        1
    ],
    "downFloor": [
        2,
        1
    ],
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}