main.floors.MT29=
{
    "floorId": "MT29",
    "title": "魔塔 第29层",
    "name": "第 29 层",
    "width": 13,
    "height": 13,
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,  0,  0,  0,  0,  0,  0,  1,  1,  1,  1,  1],
    [  1,  0,  0,  1,  1,  0,123,  0,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,330,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  0,  0,  1,  1,  0,  0,  0,  1,  1,  1,  1,  1],
    [  1, 88,  0,  1,  1,  0, 87,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 3,
    "defaultGround": "ground",
    "bgm": "section3.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            {
                "type": "if",
                "condition": "(core.searchBlock('whiteWall2', 'MT23').length > 0)",
                "true": [
                    {
                        "type": "if",
                        "condition": "flag:额外功能开关",
                        "true": [
                            "\t[小偷,thief]你先到别的地方走走，我还在挖暗道。",
                            "\t[小偷,thief]也许，你需要把之前某层的所有墙还原暗道才能挖好？",
                            {
                                "type": "sleep",
                                "time": 500
                            },
                            "\t[小偷,thief]哈哈，开玩笑的，怎么会有人这么干呢？",
                            "\t[小偷,thief]哦，我刚完成暗道。你每次都及时赶到，看在朋友的份上，你可以免费使用。好了下次见。",
                            {
                                "type": "openDoor",
                                "loc": [
                                    6,
                                    3
                                ]
                            },
                            {
                                "type": "move",
                                "loc": [
                                    6,
                                    2
                                ],
                                "time": 200,
                                "steps": [
                                    "down:9"
                                ]
                            },
                            {
                                "type": "show",
                                "loc": [
                                    [
                                        10,
                                        11
                                    ]
                                ],
                                "floorId": "MT2",
                                "time": 0
                            },
                            {
                                "type": "hide",
                                "remove": true
                            }
                        ],
                        "false": [
                            "\t[小偷,thief]你先到别的地方走走，我还在挖暗道。"
                        ]
                    }
                ],
                "false": [
                    "\t[小偷,thief]哦，我刚完成暗道。你每次都及时赶到，看在朋友的份上，你可以免费使用。好了下次见。",
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            3
                        ]
                    },
                    {
                        "type": "move",
                        "loc": [
                            6,
                            2
                        ],
                        "time": 200,
                        "steps": [
                            "down:9"
                        ]
                    },
                    {
                        "type": "show",
                        "loc": [
                            [
                                10,
                                11
                            ]
                        ],
                        "floorId": "MT2",
                        "time": 0
                    },
                    {
                        "type": "hide",
                        "remove": true
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        },
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "fgmap": [

],
    "bgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "upFloor": [
        6,
        10
    ],
    "downFloor": [
        1,
        10
    ],
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {}
}